const myQuestions_1 = [{
        question: "Вопрос №1 <br> Что такое психика?",
        answers: {
            a: "специфически человеческие, общественно и исторически обусловленные формы памяти",
            b: "системное свойство высокоорганизованной материи (мозга), проявляющееся в специфическом отражении субъектом объективной реальности",
            c: "высшая, свойственная только человеку и связанная с речью",
            d: "выделение себя из окружающего мира и противопоставление себя окружающим",
            e: "способность ставить цель и достигать ее с помощью воли",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №2 <br> Что в переводе с древнегреческого означает слово «психология»?  ",
        answers: {
            a: "наука о душе",
            b: "наука о сознании",
            c: "наука о бессознательном",
            d: "наука о поведении",
            e: "наука о высших психических функциях"
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №3 <br> Когда впервые появился термин «психология» в научном употреблении? ",
        answers: {
            a: "XV в.",
            b: "XVI в.",
            c: "XVII в.",
            d: "XVIII в.",
            d: "XIX в."
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №4 <br> Какой древнегреческий философ рассматривал душу человека как нечто божественное, отличающееся от тела?",
        answers: {
            a: '<img src="../img/democrit.jpg"> Демокрит',
            b: '<img src="../img/epikyr.jpg"> Эпикур',
            c: '<img src="../img/platon.jpg"> Платон ',
            d: '<img src="../img/aristotel.jpg" width="11%"> Аристотель',
            f: '<img src="../img/pifogor.jpg"> Пифагор',
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №5 <br> Кто является автором трактата «О душе», психологического научного труда, но ещё в рамках донаучной психологии? ",
        answers: {
            a: '<img src="../img/democrit.jpg"> Демокрит',
            b: '<img src="../img/epikyr.jpg"> Эпикур',
            c: '<img src="../img/lukrecky.jpg"> Лукреций ',
            d: '<img src="../img/aristotel.jpg" width="11%"> Аристотель',
            f: '<img src="../img/platon.jpg"> Платон ',
        },
        correctAnswer: "d"
    },
    {
        question: "Вопрос №6 <br> Р.Декарт стал основателем какой психологии? " + '<img src="../img/decart.jpg" width="15%">',
        answers: {
            a: "интроспективная",
            b: "эмпирическая ",
            c: "ассоциативная",
            d: "структурная",
            e: "экспериментальная",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №7 <br> Что такое эмоциональное отношение к окружающему миру?",
        answers: {
            a: "Оценка",
            b: "Целеполагание  ",
            c: "Самосознание",
            d: "Знание",
            e: "Сознание",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №8 <br> Это целостная характеристика психической активности людей в определённых условиях, при выполнении ими конкретных задач",
        answers: {
            a: "Психические процессы",
            b: "Психические свойства  ",
            c: "Психические состояния ",
            d: "Психические функции ",
            e: "Психические исследования",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №9 <br> Чьё имя связано с методом аутогенных тренировок? ",
        answers: {
            a: "И.Г. Шульц",
            b: "А.Ф. Лазурский  ",
            c: "Дж.Кеттел",
            d: "А. Бине ",
            e: "Т. Симон ",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №10 <br> Укажите метод воздействия, направленный на создание новых психических образований, либо на развитие уже существующих",
        answers: {
            a: "Тренинг",
            b: "Биографический метод   ",
            c: "Интервью",
            d: "Тест",
            e: "Экспериментальный метод ",
        },
        correctAnswer: "a"
    }
];
const myQuestions_2 = [{
        question: "Вопрос №1 <br> Это кратковременное задание, с помощью которого психолог стремится установить определённые психологические качества личности",
        answers: {
            a: "Тест",
            b: "Опрос",
            c: "Наблюдение",
            d: "Самонаблюдение",
            e: "Интервью",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №2 <br>Охарактеризуйте функциональный вид тренинга  ",
        answers: {
            a: "формирование и развитие навыков психической саморегуляции, релаксации",
            b: "развитие основных психических функций и процессов - памяти, внимания, мышления, воли",
            c: "тренинг общения",
            d: "тренинг социально-психологической сензитивности ",
            e: "ролевые игры"
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №3 <br> Найдите правильное определение «Деятельность» ",
        answers: {
            a: "причина, побудившая человека к деятельности ",
            b: "это динамическая система взаимодействия субъекта с миром",
            c: "регуляции человеческого поведения",
            d: "цепочка операций",
            d: "способы осуществления действий "
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №4 <br> Найдите правильное определение «Трудовая деятельность»",
        answers: {
            a: 'процесс активного изменения предметов природы, материальной и духовной жизни общества в целях удовлетворения потребностей человека и создания различных ценностей',
            b: 'особый вид деятельности, в котором исторически закрепились типичные способы действия и взаимодействия людей',
            c: 'ролевая игра, в процессе которой ребенок принимает на себя роли взрослых и действует с предметами в соответствии с приписанными значениями',
            d: 'состояние индивида, создаваемое испытываемой им нуждой в объектах, необходимых для его существования и развития, выступающее источником его активности',
            f: 'мотивационное состояние, при котором потребности соотнесены с конкретным предметом их удовлетворения',
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №5 <br> Разновидностью стремления является страсть, укажите её определение ",
        answers: {
            a: 'способы успешного выполнения действия, соответствующего целям и условиям деятельности',
            b: 'полностью автоматизированные компоненты действий',
            c: 'потребность в котором доминирует над всеми остальными потребностями и придаёт соответствующую направленность всей деятельности человека',
            d: 'активность человека, направленная на достижение сознательно поставленных целей ',
            f: 'образ потребного будущего, предполагаемый результат деятельности',
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №6 <br> Что является мотивом деятельности? ",
        answers: {
            a: "субъективный результат деятельности",
            b: "объективный результат деятельности ",
            c: "результат деятельности",
            d: "объект внешней среды, на изменение которого направлена деятельность человека",
            e: "причина, побудившая человека к деятельности и придающая этой деятельности определённую направленность",
        },
        correctAnswer: "e"
    },
    {
        question: "Вопрос №7 <br> Кто ввел категорию «деятельность»?",
        answers: {
            a: "А.Г. Асмолов",
            b: "С.Л. Рубинштейн   ",
            c: "А.Н. Леонтьев",
            d: "Л.С.Выготский",
            e: "Ж. Пиаже",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №8 <br> Укажите определение В.Д. Шадрикова о Деятельности ",
        answers: {
            a: "объективный результат деятельности, созданное в процессе деятельности изменение во внешней среде",
            b: "активность человека, направленная на достижение сознательно поставленных целей и связанная с созданием общественно значимых ценностей или освоением социального опыта   ",
            c: "результат диалектического опосредствования противоположных понятий: сознания и поведения ",
            d: "деятельность с предметами и при помощи предметов",
            e: "процесс, направленный на реализацию цели",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №9 <br> Какую обусловленную природой особенность имеет человек? ",
        answers: {
            a: "рост",
            b: "генотип",
            c: "телесная конституция",
            d: "цвет глаз",
            e: "тип нервной системы",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №10 <br> Что представляет собой современный человек?",
        answers: {
            a: "представителя вида homo sapiens ",
            b: "биологическое существо  ",
            c: "продукт длительного культурно-исторического процесса",
            d: "целостность субъекта ",
            e: "качественно новое образование",
        },
        correctAnswer: "a"
    }
]
const myQuestions_3 = [
    {
        question: "Вопрос №1 <br> На какие классы делятся неосознаваемые процессы?",
        answers: {
            a: "неосознаваемые механизмы сознательных действий",
            b: "латентная  ",
            c: "интеллектуальная",
            d: "неосознаваемые автоматизмы ",
            e: "неосознаваемые установки ",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №2 <br>  Укажите неосознаваемые установки по Д.Н.Узнадзе:",
        answers: {
            a: "схватывание предметов",
            b: "умственная",
            c: "ходьба",
            d: "латентная",
            e: "интеллектуальная",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №3 <br> Действия или акты, которые совершаются без участия сознания ",
        answers: {
            a: "моторная",
            b: "ходьба  ",
            c: "сновидение",
            d: "ошибочные действия",
            e: "невротические симптомы",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №4 <br> Кто из перечисленных мыслителей, понимали душу человека как разновидность материи, телесное образование, состоящее из шаровидных, мелких и наиболее подвижных атомов?",
        answers: {
            a: "Аристотель",
            b: "Демокрит",
            c: "Лукреций",
            d: "Платон",
            e: "Декарт",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №5 <br> Сознание, как высшая часть развития психики, включает в себя следующие компоненты: ",
        answers: {
            a: "ходьба",
            b: "Оценка",
            c: "Ощущение",
            d: "Восприятие",
            e: "Воображение",
        },
        correctAnswer: "и"
    },
    {
        question: "Вопрос №6 <br> Укажите эмоциональное состояние: ",
        answers: {
            a: "гнев",
            b: "решительность  ",
            c: "настойчивость",
            d: "ощущение",
            e: "восприятие",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №7 <br> Какие процессы относятся к познавательным?",
        answers: {
            a: "мышление",
            b: "способность  ",
            c: "темперамент",
            d: "печаль",
            e: "гнев",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №8 <br>Ряд способностей относятся к психофизиологическими функциям:",
        answers: {
            a: "способность к ощущениям",
            b: "операционально-техническая сторона ",
            c: "особый вид деятельности",
            d: "восприятие",
            e: "ощущение",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №9 <br>Что означает постановка цели?",
        answers: {
            a: "способность к ощущениям",
            b: " способность к образованию и фиксации следов прошлых воздействий ",
            c: "активное начало в субъекте",
            d: "деятельность побуждается мотивом ",
            e: "действие включает в качестве необходимого компонента акт создания в виде постановки ",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №10 <br>Укажите волевые состояния? ",
        answers: {
            a: "агрессия",
            b: "радость  ",
            c: "решительность",
            d: "способность",
            e: "темперамент",
        },
        correctAnswer: "c"
    }
]
const myQuestions_4 = [
    {
        question: "Вопрос №1 <br> Существование каких основных планов обусловливает психологический анализ системности организации деятельности?",
        answers: {
            a: "Цель деятельности ",
            b: "собственно психологический  ",
            c: "интериоризация",
            d: "экстериоризация",
            e: "категория деятельности",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №2 <br> Какую структуру имеет деятельность? ",
        answers: {
            a: "Мотив деятельности ",
            b: "нравственного    ",
            c: "Принцип  предметности",
            d: "Ппринцип  активности",
            e: "предметно-действенная",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №3 <br> Единство трудового воспитания ",
        answers: {
            a: "предметно-действенный ",
            b: "собственно психологический ",
            c: "эстетического",
            d: "духовное творчество",
            e: "раскрытие своих способностей",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №4 <br>Развитие индивидуальности в труде",
        answers: {
            a: "нравственный опыт безвозмездного труда",
            b: "культурные ценности и духовные блага  ",
            c: "духовное творчество",
            d: "нравственного  ",
            e: "нравственного, интеллектуального, эстетического, физического",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №5 <br> Какие критерии личности выделил Л.И. Божович? ",
        answers: {
            a: "раскрытие своих способностей",
            b: " способность к сознательному руководству собственным поведением ",
            c: "божественное происхождение человека",
            d: "отвечать природе человека",
            e: "нравственный опыт безвозмездного труда",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №6 <br>  Какими морфофизиологическими особенностями отличаются люди друг от друга?",
        answers: {
            a: "развитие",
            b: " трансформация ",
            c: "конституция тела",
            d: "способность",
            e: "эмоциональность",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №7 <br> Каким образом выступают формирование и жизнь человека как личности?",
        answers: {
            a: "рост",
            b: "цвет глаз  ",
            c: "подчинение мотивов",
            d: "иерархия",
            e: "непосредственные побуждения ",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №8 <br>Какие западные психологи экспериментально доказали, что главным ориентиром для Я-концепции является «Я» другого человека?",
        answers: {
            a: "У. Джеймс",
            b: "Ж.Пиаже ",
            c: "Р.Бернс ",
            d: "Ж.Пиаже",
            e: "У. Джеймс",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №9 <br>В систему психических функций включены следующие процессы:",
        answers: {
            a: "перцептивные",
            b: "психические  ",
            c: "периферические",
            d: "энергетические",
            e: "психические ",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №10 <br> Выделите из списка перцептивные системы:",
        answers: {
            a: "периферические",
            b: "сенсорные  ",
            c: "слуховая",
            d: "эпикритическая",
            e: "интенсивная",
        },
        correctAnswer: "c"
    }
]
const myQuestions_5 = [
    {
        question: "Вопрос №1 <br> Укажите цель жизни по Гегелю",
        answers: {
            a: "выразить собой часть «объективного духа» ",
            b: "осуществить «замысел божий»  ",
            c: "заботиться о физическом здоровье",
            d: "культивировать инстинкты",
            e: "жить счастливо",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №2 <br> Кто автор культурно-исторической теории психики человека?  ",
        answers: {
            a: "С.Л. Рубинштейн",
            b: "Л.С. Выготский   ",
            c: "М.М. Бахтин",
            d: "А.Н. Леонтьев",
            e: "В.П. Зинченко",
        },
        correctAnswer: "b"
    },
   
    {
        question: "Вопрос №3 <br> Какая основная особенность человека, по утверждению С.Л, Рубинштейна? ",
        answers: {
            a: "способность к опосредованному поведению",
            b: "преломление мира и собственного действия через сознание  ",
            c: "сознательное соподчинение мотивов",
            d: "биосоциальное существо",
            e: "оболочка бессмертных генов",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №4 <br>Это осознание самого себя как существа, осознающего мир и изменяющего его, как субъекта практической и теоретической деятельности",
        answers: {
            a: "самосознание",
            b: "состояние  ",
            c: "работоспособность",
            d: "отрицание",
            e: "восприятие",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №5 <br> Что такое когнитивные процессы? ",
        answers: {
            a: "психические процессы, выполняющие функцию рационального познания ",
            b: "отражение объективной реальности в форме конкретных чувственных образов  ",
            c: "отражение целостных образов объектов ",
            d: "восприятие различных сигналов",
            e: "целостность и предметность образа",
        },
        correctAnswer: "a"
    },
    {
        question: 'Вопрос №6 <br> В какой период понятие "когнитивное" получило распространение?  ',
        answers: {
            a: "в 20-е годы XX века",
            b: "в 40-е годы XX века  ",
            c: "в 60-е годы XX века",
            d: "в 80-е годы XX века",
            e: "в нач. XXI века",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №7 <br> Что означает в переводе с лат. cognitio?",
        answers: {
            a: "познание",
            b: "явление  ",
            c: "перемещение",
            d: "обучение",
            e: "значение",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №8 <br>Какой критерий является разграничением сенсорных и перцептивных процессов?",
        answers: {
            a: "целостность и предметность образа",
            b: "обнаружение и кодирование энергии физического мира  ",
            c: "модальность и субмодальность",
            d: "пространственная и временная структура",
            e: "интенсивность и длительность",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №9 <br>",
        answers: {
            a: '<img src="../img/masloy.jpg"> А. Маслоу',
            b: '<img src="../img/vudnt.jpg"> В. Вундт',
            c: '<img src="../img/levin.jpg"> К. Левин ',
            d: '<img src="../img/fromm.jpg" >   Э. Фромм',
            f: '<img src="../img/diu.jpg"> Дж. Дьюи',
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №10 <br> Это отражение отдельных свойств предметов и внутренних состояний организма при непосредственном воздействии стимулов на органы чувств",
        answers: {
            a: "Ощущение",
            b: "Восприятие  ",
            c: "Воображение",
            d: "Мышление",
            e: "Речь",
        },
        correctAnswer: "a"
    }
]
const myQuestions_6 = [
    {
        question: "Вопрос №1 <br> Восприятие, как психический процесс - это",
        answers: {
            a: "представления о соотношении величины предметов",
            b: "представления об измерениях величины предметов  ",
            c: "единство переживания и познания",
            d: "продуктивная деятельность ребенка ",
            e: "процесс, формирующий образ предметов, явлений из окружающего мира в структуры психики",
        },
        correctAnswer: "e"
    },
    {
        question: "Вопрос №2 <br> Если увидеть картинку незнакомого предмета и выделить из этого изображения один элемент, опираясь на осмысливание предмета целиком. Как называется это осмысление? ",
        answers: {
            a: "перцепция",
            b: "апперцепция  ",
            c: "приятие",
            d: "синкретизм",
            e: "созерцание",
        },
        correctAnswer: "d"
    },
   
    {
        question: "Вопрос №3 <br>  Каким образом Дж. Гибсон трактует воспринимание?",
        answers: {
            a: "совокупность атомарных чувственных ощущений",
            b: "структурное и целостное явление  ",
            c: "активный процесс присвоения информации из мира, который включает реальное обследование той информации, которая воспринимается",
            d: "один из основных психических познавательных процессов формирующий в нашем сознании субъективную картину мира",
            e: "процесс отображения характерных свойств предметов и явлений в психике",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №4 <br>Он твердил, что восприятие в психологии это процесс извлечение информации из объектов внешнего мира, который осуществляется на основе схем разных предметов и целого мира, которые имеются в субъекте",
        answers: {
            a: "У. Нессер ",
            b: "Дж. Гибсон   ",
            c: "И.М. Сеченов ",
            d: "З. Фрейд",
            e: "К. Юнг",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №5 <br>  Именно ей возможно осознавать, что с нами происходит и как мир влияет на нас",
        answers: {
            a: "предметность",
            b: "перцепция  ",
            c: "иллюзия",
            d: "избирательность",
            e: "оценка",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №6 <br> Она трактовала ощущения, как базовые элементы психики ",
        answers: {
            a: "Философия",
            b: "Целостность и структурность  ",
            c: "Ассоциативная психология",
            d: "Анатомия",
            e: "Константность",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №7 <br> Что означает «Внимание»?",
        answers: {
            a: "количество не связанных объектов, которые могут одновременно восприниматься ясно и отчётливо",
            b: " сознательное, преднамеренное, целенаправленное изменение направленности психической деятельности ",
            c: "произвольная или непроизвольная направленность и сосредоточенность психической деятельности на каком-либо объекте восприятия",
            d: "внешнее торможение, вызванное посторонними раздражителями, или продолжительное действие одного и того же раздражителя",
            e: "регуляция и контроль протекания деятельности",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №8 <br>Укажите в рамках основных свойств ощущения, субъективное отражение различных признаков объекта  для кожной чувствительности:",
        answers: {
            a: "апперцепция",
            b: "созерцание  ",
            c: "температура",
            d: "пространственность",
            e: "признак",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №9 <br>Какие синонимы имеет Восприятие?",
        answers: {
            a: "апперцепция",
            b: "прикосновение ",
            c: "давление",
            d: "создание",
            e: "превращение",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №10 <br> П. Фресс указывает, что стрессогенными являются условия, при которых человек не способен, не умеет или не готов действовать. Укажите их. ",
        answers: {
            a: "новизна",
            b: "ступор  ",
            c: "создание",
            d: "впечатление",
            e: "аврал",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №11 <br>Стресс проявляется в несвязности речи, растерянности, нарушении памяти и пр. Протекает в три этапа (Г. Селье). Укажите их. ",
        answers: {
            a: "новизна",
            b: "стабилизация  ",
            c: "ступор",
            d: "боль",
            e: "потеря крови",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №12 <br> Приведите примеры интеллектуальных чувств",
        answers: {
            a: "боль",
            b: "Уверенность в правильности доказательства  ",
            c: "потеря крови",
            d: "Гуманность",
            e: "Доброжелательность",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №13 <br> Основные признаки волевого акта:",
        answers: {
            a: "аларм ",
            b: "наличие продуманного плана осуществления поведенческого акта  ",
            c: "резистентность в результате его исполнения",
            d: "активность человека, которая порождает действие в силу специфики внутренних состояний субъекта",
            e: "усиление мотивации и совершенствование на этой основе сознательной регуляции действий",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №14 <br> Три основные стадии развития стресса по Г. Селье:",
        answers: {
            a: "движение глаз",
            b: "резистентность  ",
            c: "ощупывание предметов",
            d: "реакция",
            e: "позиция",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №15 <br> Существует как минимум три механизма благотворного действия физических упражнений при стрессе.",
        answers: {
            a: "экономия в человеческом  усилии",
            b: "классификация усилий человека  ",
            c: "движение глаз",
            d: "ощупывание предметов",
            e: "регулярные упражнения вызывают в организме определённые изменения",
        },
        correctAnswer: "e"
    },
    {
        question: "Вопрос №16 <br> Укажите моторные компоненты процесса восприятия, с помощью которых реализовывается восприятие информации:",
        answers: {
            a: "аларм",
            b: "ощупывание предметов  ",
            c: "указание времени",
            d: "положение предмета ",
            e: "резистентность",
        },
        correctAnswer: "b"
    },
]
const myQuestions_7 = [
    {
        question: "Вопрос №1 <br> Под константностью следует понимать: ",
        answers: {
            a: "двигательная",
            b: "величина  ",
            c: "сенсорная",
            d: "свойства",
            e: "анализатор",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №2 <br> Укажите понятия, характеризующие познавательный процесс «Память»? ",
        answers: {
            a: "непосредственая натуральная",
            b: " в психологии часто называют мнемической деятельностью в честь древнегреческой богини Мнемозины ",
            c: "внешне опосредованная ",
            d: "умение одновременно выполнять несколько действий",
            e: "объем составляет в среднем 7+-2 элемента",
        },
        correctAnswer: "b"
    },
   
    {
        question: "Вопрос №3 <br> По использованным для запоминания средствам память бывает: ",
        answers: {
            a: "непроизвольная, произвольная",
            b: "двигательная ",
            c: "эмоциональная  ",
            d: "целенаправленная, завершенная",
            e: "внутренне опосредствованная",
        },
        correctAnswer: "e"
    },
    {
        question: "Вопрос №4 <br>По характеру психической активности в структуру памяти входят:",
        answers: {
            a: "билингвистический опыт",
            b: "конформность   ",
            c: "словесно-логическая ",
            d: "сенсорная",
            e: "кратковременная ",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №5 <br>Развитию воображения препятствуют:   ",
        answers: {
            a: "стимулирование независимости, самостоятельных разработок",
            b: "билингвистический опыт  ",
            c: "конформность",
            d: "сенсорная",
            e: "ситуация незавершенности",
        },
        correctAnswer: "c"
    },
    {
        question: 'Вопрос №6 <br> В её основу положен "Мозговой штурм".  Как называется это основа? ',
        answers: {
            a: "синектика",
            b: "сенсорная  ",
            c: "трансдукция ",
            d: "ассоциация",
            e: "Л. С. Выготский",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №7 <br> Проблема соотношения языка и речи развивалась в трудах выдающихся языковедов:",
        answers: {
            a: "А. Сеше",
            b: "У. Гордон  ",
            c: "Дж. Локк",
            d: "Дж. Гибсон",
            e: "У. Нессер",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №8 <br>Речь является объектом изучения разных областей науки:",
        answers: {
            a: "география",
            b: "Эстетические   ",
            c: "психолингвистика",
            d: "социолингвистика",
            e: "химия",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №9 <br>Как и в случае с эмоциями, понятие чувства в психологии позволяет создать определённую классификацию. Укажите их.",
        answers: {
            a: "Интеллектуальные",
            b: "конформность  ",
            c: "разделение игры и обучения ",
            d: "Физиологические",
            e: "Личностные",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №10 <br> Внимание – это направленность психики (сознания) на определённые объекты, имеющие для личности устойчивую или ситуативную значимость, сосредоточение психики (сознания), предполагающие повышенный уровень ..., ... или ... активности. Найдите в ответах уровни активности",
        answers: {
            a: "избирательная, сознательная, полусознательная",
            b: "сенсорная, интеллектуальная, двигательная  ",
            c: "произвольная, непроизвольная, интеллектуальная",
            d: "моторная, вегетативная, двигательная",
            e: "продуктивная, когнитивная, исполнительной",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №11 <br> С какими понятиями представители нейрофизиологического направления исследований традиционно связывают внимание?",
        answers: {
            a: "ретикулярная формация, избирательная активация ",
            b: "головной мозг, спинной мозг  ",
            c: "двигательные ядра, нарушение внимание",
            d: "доминанта, активация, ориентировочная реакция",
            e: "внешние реакции, селективность информации, анализ",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №12 <br> Это состояние поглощенности субъекта предметом деятельности, отвлечения от побочных, не относящихся к нему условий и объектов",
        answers: {
            a: "сосредоточенность на выполнении определенной деятельности ",
            b: "увеличение продуктивности когнитивной деятельности  ",
            c: "увеличение продуктивности исполнительной деятельности",
            d: "реагирование на ограниченный круг внешних стимулов",
            e: "сосредоточенность на определенных объектах",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №13 <br>«Цель человека – быть самим собой, а условие достижения этой цели быть человеком для себя». Укажите автора. ",
        answers: {
            a: "Г.Гербарт",
            b: "Г.Мюллер  ",
            c: "Э.Фромм",
            d: "Г.Гельмгольц",
            e: "О.Кюльпе",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №14 <br> В каком состоянии возможен избирательный характер протекания психических процессов?",
        answers: {
            a: "сон",
            b: "бодрствование  ",
            c: "спокойствие",
            d: "безопасность",
            e: "отстранение",
        },
        correctAnswer: "c"
    },
    {
        question: "Вопрос №15 <br> Это способность человека к построению новых образов путем переработки психических компонентов, приобретенных в прошлом опыте",
        answers: {
            a: "Память",
            b: "Воображение  ",
            c: "Мышление",
            d: "Восприятие",
            e: "Ощущение",
        },
        correctAnswer: "b"
    },
    {
        question: "Вопрос №16 <br>Этот метод предложен А. Осборном (США), предназначен для продуцирования идей и решений при работе в группе ",
        answers: {
            a: "Брейнсторминг",
            b: "Мозговой штурм  ",
            c: "Синектический штурм",
            d: "Фокальный объект",
            e: "Морфологический анализ",
        },
        correctAnswer: "a"
    },
    {
        question: "Вопрос №17 <br>Как рассматривал Гальперин П.Я. в своей теории внимание? ",
        answers: {
            a: "процесс контроля за действиями",
            b: "сосредоточенность психической деятельности на каком-либо объекте восприятия  ",
            c: "психофизиологический процесс, состояние, характеризующее динамические особенности познавательных процессов",
            d: "направленность психики (сознания) на определенные объекты",
            e: "не имеет своего отдельного, специфического продукта",
        },
        correctAnswer: "a"
    },
]


// test 1
const quizContainer = document.getElementById('test1-quiz');
const resultsContainer = document.getElementById('test-results');
const submitButton = document.getElementById('test1-submit');
// test 2
const quizContainer2 = document.getElementById('test2-quiz');
const resultsContainer2 = document.getElementById('test-results2');
const submitButton2 = document.getElementById('test2-submit');
//test 3
const quizContainer3 = document.getElementById('test3-quiz');
const resultsContainer3 = document.getElementById('test-results3');
const submitButton3 = document.getElementById('test3-submit');
//test 4
const quizContainer4 = document.getElementById('test4-quiz');
const resultsContainer4 = document.getElementById('test-results4');
const submitButton4 = document.getElementById('test4-submit');
//test 5
const quizContainer5 = document.getElementById('test5-quiz');
const resultsContainer5 = document.getElementById('test-results5');
const submitButton5 = document.getElementById('test5-submit');
//test 6
const quizContainer6 = document.getElementById('test6-quiz');
const resultsContainer6 = document.getElementById('test-results6');
const submitButton6 = document.getElementById('test6-submit');
//test 7
const quizContainer7 = document.getElementById('test7-quiz');
const resultsContainer7 = document.getElementById('test-results7');
const submitButton7 = document.getElementById('test7-submit');


generateQuiz(myQuestions_1, quizContainer, resultsContainer, submitButton); //test1
generateQuiz(myQuestions_2, quizContainer2, resultsContainer2, submitButton2); //test2
generateQuiz(myQuestions_3, quizContainer3, resultsContainer3, submitButton3); //test3
generateQuiz(myQuestions_4, quizContainer4, resultsContainer4, submitButton4); //test4
generateQuiz(myQuestions_5, quizContainer5, resultsContainer5, submitButton5); //test5
generateQuiz(myQuestions_6, quizContainer6, resultsContainer6, submitButton6); //test6
generateQuiz(myQuestions_7, quizContainer7, resultsContainer7, submitButton7); //test7

function generateQuiz(questions, quizContainer, resultsContainer, submitButton) {

    function showQuestions(questions, quizContainer) {
        // we'll need a place to store the output and the answer choices
        var output = [];
        var answers;

        // for each question...
        for (var i = 0; i < questions.length; i++) {

            // first reset the list of answers
            answers = [];

            // for each available answer...
            for (letter in questions[i].answers) {

                // ...add an html radio button
                answers.push(
                    '<label>' +
                    '<input type="radio" name="question' + i + '" value="' + letter + '">' +
                    letter + ': ' +
                    questions[i].answers[letter] +
                    '</label>'
                );
            }

            // add this question and its answers to the output
            output.push(
                '<div class="question">' + questions[i].question + '</div>' +
                '<div class="answers">' + answers.join('') + '</div>'
            );
        }

        // finally combine our output list into one string of html and put it on the page
        quizContainer.innerHTML = output.join('');
    }


    function showResults(questions, quizContainer, resultsContainer) {

        // gather answer containers from our quiz
        var answerContainers = quizContainer.querySelectorAll('.answers');

        // keep track of user's answers
        var userAnswer = '';
        var numCorrect = 0;

        // for each question...
        for (var i = 0; i < questions.length; i++) {

            // find selected answer
            userAnswer = (answerContainers[i].querySelector('input[name=question' + i + ']:checked') || {}).value;

            // if answer is correct
            if (userAnswer === questions[i].correctAnswer) {
                // add to the number of correct answers
                numCorrect++;

                // color the answers green
                answerContainers[i].style.color = 'lightgreen';
            }
            // if answer is wrong or blank
            else {
                // color the answers red
                answerContainers[i].style.color = 'red';
            }
        }

        // show number of correct answers out of total
        resultsContainer.innerHTML = numCorrect + ' из ' + questions.length;
    }

    // show questions right away
    showQuestions(questions, quizContainer);

    // submitButton.addEventListener('click', function () {
    //     showResults(questions, quizContainer, resultsContainer);
    //   });
    // on submit, show results
    submitButton.onclick = function () {
        showResults(questions, quizContainer, resultsContainer);
    }

}